my_dict = {'Саморез': 20, 'Гайка': 10, 'Сверло': 40}
print(my_dict) # Вывод на экран
print(my_dict.get('Гайка')) # значение по существующему ключу
print(my_dict.get('Болтик'))#  по отсутствующему ключу
my_dict.update({'Гвоздь': 5, # Довавленные пары
               'Веревка:': 300,})
memory = my_dict.pop('Сверло') # Удаленное слово
print(memory)
print(my_dict)
my_set = {1, 1, 33, 49, 33, 50, 33, 'Сейф', "Пароль", "Пароль"} # Множнства
print("______________________________________________________")
print(my_set)
my_set.add(6)
my_set.add('Ключ')
my_set.discard(33)
print(my_set)


